[
  {
    "rss": false,
    "root_relative_filename": "index.md",
    "updated_hr": "2023-01-27T13:13:35Z",
    "tags": [
      "site"
    ],
    "author": "Christian Clifford",
    "summary": "This is the summary of this page",
    "updated": "1674857615",
    "created_hr": "2022-12-29T19:30:51Z",
    "created": "1672374651",
    "relative_filename": "content/index.md",
    "title": "Hello",
    "content": "<p>This is my website.</p>\n"
  },
  {
    "created_hr": "2023-01-27T12:37:24Z",
    "created": "1674855444",
    "relative_filename": "content/talk.12.7.2022.org",
    "updated": "1674857106",
    "root_relative_filename": "talk.12.7.2022.org",
    "title": "Joy in this Life",
    "tags": [
      "religion",
      "talks",
      "wilderness"
    ],
    "author": "Christian Clifford",
    "updated_hr": "2023-01-27T13:05:06Z",
    "rss": "true",
    "content": "<p>Sometimes life sucks. We stub out toes. Our favorite things break. A\nfavorite TV show is canceled. Someone that we know and love passes away.\nOur time on the earth may sometimes feel like it is an endless drudgery\nof sadness and heartbreak. We might feel like nothing can change or get\nbetter. It can be easy to feel that life is pointless or wearisome as we\nface challenges in life.</p>\n<p>In the Book of Mormon, Lehi dealt with some of the same feelings.\nListen to how he felt looking back over his life as he spoke to his son\nJacob:</p>\n<blockquote>\n<p>Thou art my firstborn in the days of my tribulation in the\nwilderness. And behold, in thy childhood thou hast suffered afflictions\nand much sorrow, because of the rudeness of thy brethren.</p>\n</blockquote>\n<p>He describes his time in the wilderness as a tribulation. I think\nthat each of us can at times feel that we are in the wilderness, in much\nthe same way.</p>\n<p>Lehi had a similar experience in his vision of the Tree of Life. He\nsaid,</p>\n<blockquote>\n<p>5 And it came to pass that I saw a man, and he was dressed in a white\nrobe; and he came and stood before me.</p>\n<p>6 And it came to pass that he spake unto me, and bade me follow\nhim.</p>\n<p>7 And it came to pass that as I followed him I beheld myself that I\nwas in a dark and dreary waste.</p>\n</blockquote>\n<p>I can think of another couple who was driven out into the wilderness\nafter they had spent time living in the presence of God: Adam and Eve.\nThey started out living in the presence of god in the Garden of Eden.\nLater, after sinning, they were separated from the presence of God and\nentered a wilderness.</p>\n<p>The scriptures are filled with instances and examples of using\n'wilderness' to describe a time of affliction and hardship, or maybe\nlife as a whole. They are times when we are separated from the presence\nof God and when we are more open to temptation. The New Testament\nrelates that after His baptism, Jesus Christ went out into the\nwilderness to be tempted.</p>\n<p>I hope that I have established by now that there are times that life\nis not joyful; if any of you somehow doubted that. I also hope that I\nhave also established that the scriptures also often talk about times of\naffliction as being like a wilderness, or as afflicitons as taking place\nin the wilderness.</p>\n<p>Life is like the wilderness. We are separated from God and are not\nimmediately in His presence. But we do not have to remain out of God's\npresence, even as we remain in the world. Jesus Christ is the solution\nto that riddle.</p>\n<blockquote>\n<p>10 And the angel said unto them, Fear not: for, behold, I bring you\ngood tidings of great joy, which shall be to all people.</p>\n<p>11 For unto you is born this day in the city of David a Saviour,\nwhich is Christ the Lord.</p>\n<p>(Luke 2:10-11)</p>\n</blockquote>\n<p>Jesus Christ came into the world to experience affliction and\novercome it. He comes into our lives to experience our afflictions and\novercome them. much as Lehi and his family had the Leahona to guide and\ndirect them in the wilderness, we can have the influence of God as we\ntry to navigate our lives.</p>\n<p>What does that do for us? Even when we know that God is with us on\nour journey through the wilderness, it is still a journey and it can\nstill feel like a long way. But it is not so much of a wilderness\nbecause we have a path. There is a goal to reach and a way to get there.\nHaving the influence of God in our lives does not change the sorts of\nthings that we might experience during this life. Good things and bad\nthings happen to both members of the church and staunch athiests, but\nhaving God with us in our mortal journey allows us to <em>relate</em> to\nour struggle in a different way. It <em>changes</em> or <em>redeems</em>\nthe trials that happen to us. Knowing that God is present in the world\nallows us to have faith, even as Lehi had faith, that \"he shall\nconsecrate thine afflictions for thy gain\".</p>\n<p>Another way of thinking about it is that recognizing the influence\nand presence of God in the world and in our lives instills our lives\nwith meaning. It fills the patterns of human life and the hardships that\naccompany it with meaning and purpose. That is something that I like to\nthink about.</p>\n<p>Lehi wrote a bit about that in the context of his vision.</p>\n<blockquote>\n<p>8 And after I had traveled for the space of many hours in darkness, I\nbegan to pray unto the Lord that he would have mercy on me, according to\nthe multitude of his tender mercies.</p>\n<p>9 And it came to pass after I had prayed unto the Lord I beheld a\nlarge and spacious afield.</p>\n<p>10 And it came to pass that I beheld a tree, whose fruit was\ndesirable to make one happy.</p>\n</blockquote>\n<p>When Lehi prayed to the Lord, his situation changed. He was able to\nsee a goal to reach where there was not one before. Similarly, he wrote\nto his sone Jacob that</p>\n<blockquote>\n<p>14 And now, my sons, I speak unto you these things for your profit\nand learning; for there is a God, and he hath created all things, both\nthe heavens and the earth, and all things that in them are, both things\nto act and things to be acted upon.</p>\n<p>15 And to bring about his eternal purposes in the end of man, after\nhe had created our first parents, and the beasts of the field and the\nfowls of the air, and in fine, all things which are created, it must\nneeds be that there was an opposition.</p>\n</blockquote>\n<blockquote>\n<p>25 Adam fell that men might be; and men are, that they might have\njoy.</p>\n<p>(2nd Nephi 2:25)</p>\n</blockquote>\n<blockquote>\n<p>10 And in that day Adam blessed God and was filled, and began to\nprophesy concerning all the families of the earth, saying: Blessed be\nthe name of God, for because of my transgression my eyes are opened, and\nin this life I shall have joy, and again in the flesh I shall see\nGod.</p>\n<p>11 And Eve, his wife, heard all these things and was glad, saying:\nWere it not for our transgression we never should have had seed, and\nnever should have known good and evil, and the joy of our redemption,\nand the eternal life which God giveth unto all the obedient.</p>\n</blockquote>\n"
  },
  {
    "updated": "1674850928",
    "title": "Five-Minute Talk",
    "created": "1673309587",
    "relative_filename": "content/talk.2.3.1.org",
    "created_hr": "2023-01-09T15:13:07Z",
    "author": "Christian Clifford",
    "root_relative_filename": "talk.2.3.1.org",
    "updated_hr": "2023-01-27T11:22:08Z",
    "tags": [
      "religion",
      "talks"
    ],
    "content": "<h1 id=\"five-minute-talk-based-on-silent-night\">five-minute talk based\non Silent night</h1>\n<p>You are probably pretty sick of hearing from me by now. That is\nalright. The song that I was asked to base my talk upon is \"Silent\nNight\". This song is based around three repeated phrases, one for each\nverse. They are,</p>\n<ul>\n<li>\"Sleep in heavenly peace\"</li>\n<li>\"Jesus, lord at thy birth\",</li>\n<li>\"Christ the Savior is born\".</li>\n</ul>\n<p>I will breifly comment on all three topics.</p>\n<h2 id=\"sleep-in-heavenly-peace\">\"Sleep in heavenly peace\"</h2>\n<p>This phrase also talks about peace. Christmas is a time when we can\ntry to reconcile differences and make peace. Jesus said, \"Blessed are\nthe peacemakers, for they shall be called the children of god\"</p>\n<h2 id=\"jesus-lord-at-thy-birth\">\"Jesus, Lord, at thy birth\"</h2>\n<p>Christ was born as a baby, like everyone else. He was born into poor\ncircumstances. We make a lot of that, but it actually is important. The\nscriptures continually speak about the importance of taking care of the\npoor. They condemn mistreating the poor and failure to take care of\nthem. The Christmas season has long been associated with charity and\ncaring for the poor</p>\n<h2 id=\"christ-the-savior-is-born\">\"Christ, the Savior, is born\"</h2>\n<p>Chris is our savior</p>\n"
  }
]
